## Домашнее задание 8. Основы Pandas

## Задание 1

Определите, какому фильму было выставлено больше всего оценок 5.0.

In [225]:
import pandas as pd

In [227]:
# Импортируем таблицу Рейтинга
ratings = pd.read_csv('data/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [229]:
# Отфильтруем среди всех оценок: оценки 5.0
ratings_5 = ratings[ ratings.rating == 5.0 ]
ratings_5.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [231]:
# Вычислим для каждого movieId количество оценок (5.0)
movies_5 = ratings_5.value_counts(subset='movieId')
movies_5.head()

movieId
318     153
296     123
356     116
2571    109
260     104
Name: count, dtype: int64

In [233]:
# Введем индексы для полученного Series, получим movieId с наибольшим количеством оценкок (5.0)
movieId_5 = movies_5.index[0]

In [235]:
# Импортируем таблицу Фильмов
movies = pd.read_csv('data/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [237]:
# Получаем информацию о фильме по movieId
movie_5 = movies[ movies.movieId == movieId_5 ]
movie_5.head()

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

In [245]:
print(f'Наибольшее количество оценок 5.0 получил фильм: \t {movie_5.title.tolist()[0]}')

Наибольшее количество оценок 5.0 получил фильм: 	 Shawshank Redemption, The (1994)

## Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [247]:
# Импортируем таблицу Потребления энергии
power = pd.read_csv('data/power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [295]:
# Отфильтруем среди всех стран: страны Прибалтики (Латвия, Литва, Эстония)
BS_power = power[ (power.country == 'Latvia') | (power.country == 'Lithuania') | (power.country == 'Estonia') ]
BS_power.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [297]:
# Отфильтруем из полученного списка категории: 4, 12, 21
BS_C4_C12_C21_power = BS_power[ (BS_power.category == 4) | (BS_power.category == 12) | (BS_power.category == 21) ]
BS_C4_C12_C21_power.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [299]:
# Отфилтруем из полученного списка года: с 2005 по 2010 (включительно)
BS_C4_C12_C21_2005_2010_power = BS_C4_C12_C21_power[ (2005 <= BS_C4_C12_C21_power.year) & (BS_C4_C12_C21_power.year <= 2010) ]
BS_C4_C12_C21_2005_2010_power.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [301]:
# Отфильтруем из полученного списка только положительные значения потребления
BS_C4_C12_C21_2005_2010_AZ_power = BS_C4_C12_C21_2005_2010_power[ BS_C4_C12_C21_2005_2010_power.quantity >= 0 ]
BS_C4_C12_C21_2005_2010_AZ_power.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [303]:
# суммируем значения по столбцу quantity
req_power = BS_C4_C12_C21_2005_2010_AZ_power.quantity.sum()

In [305]:
print(f'Суммарное потребление энергии странами Прибалтики категорий 4, 12, 21 за период с 2005 по 2010 год: \t {req_power}')

Суммарное потребление энергии странами Прибалтики категорий 4, 12, 21 за период с 2005 по 2010 год: 	 240580.0